[
	{"emotion": "neutral", "texture": "res://Assets/Sprites/Dialogue/Guntheidon/Guntheidon.png"},
	{"emotion": "ponder", "texture": "res://Assets/Sprites/Dialogue/Guntheidon/Guntheidon_PONDER.png"},
	{"emotion": "sad", "texture": "res://Assets/Sprites/Dialogue/Guntheidon/Guntheidon_SAD.png"},
	
	{"chat_num": "0", "name": "Guntheidon", "emotion": "neutral", "text": "Ah, the Common Slime… not so common after all. You know, I’ve noticed they react the same way no matter what you put in front of them. Do they truly have no taste? Or perhaps they simply appreciate all culinary delights equally? Personally, I’m partial to a fine cheese… but I’ve been having great difficulty finding a minotaur amicable enough for me to milk it."},
	{"chat_num": "1", "name": "Guntheidon", "emotion": "ponder", "text": "The Dinglebats’ glowing orbs… fascinating. Gertrude suggested they may have a social purpose. If I were you, I’d get two of them together. See how they react to one another. Sometimes, the real magic happens when you have double the orbs, no? I may have to rethink my theory about them being tiny dungeon lighthouses…"},
	{"chat_num": "2", "name": "Guntheidon", "emotion": "neutral", "text": "The Shroomen? Ah, yes… strange little beings, aren’t they? They seem harmless enough, until you realize they’re watching you too. You’ll notice they act differently when they’re together. It’s almost like they’re… plotting something. But how do they communicate? Pheromones? Interpretive dance? We won’t know until you put two of them together. This could get… interesting."},
	{"chat_num": "3", "name": "Guntheidon", "emotion": "ponder", "text": "The Plains Imps… tricky creatures, those. They live for the hunt, but not in the way you’d think. No, it’s the chase that excites them. They’ll stalk their prey for hours, watching, waiting, learning. I suspect they enjoy it more than the actual kill. But here’s the thing—they don’t always hunt alone. You’ll often find them alongside something bigger, something nastier. Almost as if they enjoy the company of death itself. Throw another carnivore in their enclosure and watch. The Imp will either outwit its new friend or end up as dinner. Nature at its finest, wouldn’t you agree?"},
	{"chat_num": "4", "name": "Guntheidon", "emotion": "neutral", "text": "Ah, the Shallows Jellies, nature’s little decorators! But why do they bother? Some think it’s for camouflage, others say it’s pure vanity. Adorning themselves with whatever they can find—shells, stones, even bits of broken weapons. Some say it’s for protection, but I think they just like to look fancy. They pick and choose their decorations carefully, you know. I tried giving one a shiny coin once… it dropped it in favour of a rusty nail. Clearly, they’ve got a strange sense of fashion. My advice? Catch a few from different dungeon floors - see if their trends change."},
	{"chat_num": "5", "name": "Guntheidon", "emotion": "sad", "text": "The Nekomata… now, that’s a creature steeped in mystery. Many have seen its blue flame, but few understand it. There are tales of them leading lost adventurers to safety, but why? Some say the flame always points to the dungeon’s exit. But here’s the thing - no one really knows what the flame is. Some say it’s a guide, others say it’s a lure. Personally, I think it’s both. It just depends on how the Nekomata feels about you that day. Catch one yourself and see if it guides you, or if it’s simply playing tricks on us all."}
]
